---
kind: property
id: P:Autodesk.Revit.DB.CitySet.Size
source: html/86a590c3-9481-a823-e944-3bcc6f151328.htm
---
# Autodesk.Revit.DB.CitySet.Size Property

Returns the number of cities that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```